#include "EndScene.h"
#include "DxLib.h"

/**********************************
*マクロ定義
**********************************/

/**********************************
*型定義
**********************************/

/**********************************
*変数宣言
**********************************/
int wait_count;
int EndScene;

/**********************************
*プロトタイプ宣言
**********************************/

/**********************************
*エンド画面:初期化処理
* 引　数:なし
* 戻り値:エラー情報(-1:以上有,-1以外:正常)
**********************************/
int EndScene_Initialize(void)
{
	int ret = 0;

	wait_count = 0;

	EndScene = LoadGraph("images/end.png");

	return ret;
}

/**********************************
*エンド画面:更新処理
* 引　数:なし
* 戻り値:なし
**********************************/
void EndScene_Update(void)
{
	wait_count++;
}

/**********************************
*エンド画面:描画処理
* 引　数:なし
* 戻り値:なし
**********************************/
void EndScene_Draw(void)
{
	DrawGraph(0, 0, EndScene, TRUE);
}

/**********************************
*エンド画面:終了確認処理
* 引　数:なし
* 戻り値:なし
**********************************/
int Get_EndTime(void)
{
	if (wait_count > 300)
	{
		return TRUE;
	}
	return FALSE;
}