#include "InputControl.h"
#include "DxLib.h"

/**********************************
*マクロ定義
**********************************/
#define XINPUT_BUTTON_MAX (16)			//コントローラーのボタン数

/**********************************
*型定義
**********************************/
enum KEY_STATE
{
	E_NONE,					//未入力
	E_CLICK,				//押した瞬間
	E_PRESS,				//押し続けてる
	E_RELEASED,				//離した
	E_KEY_STSTE_MAX
};

/**********************************
*変数宣言
**********************************/
KEY_STATE button_state[XINPUT_BUTTON_MAX];		//各ボタン入力状態

/**********************************
*プロトタイプ宣言
**********************************/

/**********************************
*入力制御機能:初期化処理
* 引　数:なし
* 戻り値:なし
**********************************/
void InputCOntrol_Initialize(void)
{
	int i;			//ループカウンタ

	//入力状態の初期化
	for (i = 0; i < XINPUT_BUTTON_MAX; i++)
	{
		button_state[i] = E_NONE;
	}
}