#include "SceneManager.h"
#include"TitleScene.h"
#include"GameMainScene.h"
#include"RankingScene.h"
#include"EndScene.h"
#include"DxLib.h"

/**********************************
*マクロ定義
**********************************/

/**********************************
*型定義
**********************************/

/**********************************
*変数宣言
**********************************/
GAME_MODE game_mode;			//ゲームモード情報
GAME_MODE next_mode;			//次のゲームモード
int read_error;					//読み込みエラー確認

/**********************************
*プロトタイプ宣言
**********************************/

/**********************************
*タイトル画面:初期化処理
* 引　数:ゲームモード情報
* 戻り値:なし
**********************************/
void SceneManager_Initialize(GAME_MODE mode)
{
	read_error = D_NORMALITY;
}

/**********************************
*タイトル画面:更新処理
* 引　数:なし
* 戻り値:なし
**********************************/

/**********************************
*タイトル画面:描画処理
* 引　数:なし
* 戻り値:なし
**********************************/